Catalogs/ШаблоныКодовМаркировкиСУЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ШаблоныКодовМаркировкиСУЗ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппыГИСМТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКодаМаркировки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКодовМаркировкиИСМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаСерийногоНомера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКлассификаторовВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСуммаПоставляемыхДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШаблоныРазбораКодовМаркировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШаблонРазбораКодовМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныРазбораКодовМаркировкиИСМП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Импорт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыКодовМаркировкиИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКодовМаркировкиИСМП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЕдиницаТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрупповаяУпаковка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ШаблоныКодовМаркировкиСУЗ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Возврат;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроверитьНаДубли(Отказ);
	
	ХешСуммаТекущегоСостояния = ХешСуммаТекущегоСостояния();
	
	Если ХешСуммаТекущегоСостояния <> ХешСумма Тогда
		ХешСумма = ХешСуммаТекущегоСостояния;
	КонецЕсли;
	
	Если ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ЭтоРасширеннаяВерсияГосИС() Тогда
		МодульИнтеграцияИСПереопределяемый = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ИнтеграцияИСПереопределяемый");
		МодульИнтеграцияИСПереопределяемый.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Архивный                   = Неопределено;
	Идентификатор              = Неопределено;
	Код                        = Неопределено;
	ХешСуммаПоставляемыхДанных = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьНаДубли(Отказ)
	
	Если Не ИспользоватьПоУмолчанию Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",         Ссылка);
	Запрос.УстановитьПараметр("ТоварнаяГруппа", ТоварнаяГруппа);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШаблоныКодовМаркировки.Ссылка
	|ИЗ
	|	Справочник.ШаблоныКодовМаркировкиСУЗ КАК ШаблоныКодовМаркировки
	|ГДЕ
	|	ШаблоныКодовМаркировки.Ссылка <> &Ссылка
	|	И ШаблоныКодовМаркировки.ТоварнаяГруппа = &ТоварнаяГруппа
	|	И ШаблоныКодовМаркировки.ИспользоватьПоУмолчанию
	|	И (ШаблоныКодовМаркировки.ТипКодаМаркировки = Значение(Перечисление.ТипыКодовМаркировкиИСМП.ЕдиницаТовара)
	|		ИЛИ ШаблоныКодовМаркировки.ТипКодаМаркировки = Значение(Перечисление.ТипыКодовМаркировкиИСМП.Комплект))";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
			НСтр("ru = 'Для товарной группы <%1> уже назначен шаблон <%2> используемый по умолчанию.'"),
			ТоварнаяГруппа,
			Выборка.Ссылка));
	КонецЕсли;
	
КонецПроцедуры

Функция ХешСуммаТекущегоСостояния()

	ДанныеДляРасчета = Новый СписокЗначений();
	
	ДанныеДляРасчета.Добавить(Наименование);
	ДанныеДляРасчета.Добавить(Код);
	ДанныеДляРасчета.Добавить(ТоварнаяГруппа);
	ДанныеДляРасчета.Добавить(ТипШтрихкода);
	ДанныеДляРасчета.Добавить(ДлинаСерийногоНомера);
	ДанныеДляРасчета.Добавить(Архивный);
	ДанныеДляРасчета.Добавить(ИспользоватьПоУмолчанию);
	ДанныеДляРасчета.Добавить(Статус);
		
	Для каждого ЭлементСостава Из ШаблоныРазбораКодовМаркировки Цикл
		СтрокаШаблонов = Новый Массив;
		СтрокаШаблонов.Вставить(0, ЭлементСостава.ШаблонРазбораКодовМаркировки);
		СтрокаШаблонов.Вставить(1, ЭлементСостава.Импорт);
		
		ХешСуммаСтрокиСостава = ОбщегоНазначенияИС.ХэшСуммаСтроки(СтрСоединить(СтрокаШаблонов));
		ДанныеДляРасчета.Добавить(ХешСуммаСтрокиСостава);
		
	КонецЦикла;
	
	ДанныеДляРасчета.СортироватьПоЗначению();
	
	СтрокаДляРасчетаХеша = СтрСоединить(ДанныеДляРасчета.ВыгрузитьЗначения());

	Возврат ОбщегоНазначенияИС.ХэшСуммаСтроки(СтрокаДляРасчетаХеша);
	
КонецФункции

#КонецОбласти

#КонецЕсли
